RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_usb_library/driver/Include/drv_usb_regs.h
#define GRXSTS_PKTSTS_IN                        2U
#define GRXSTS_PKTSTS_IN_XFER_COMP              3U
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERR           5U
#define GRXSTS_PKTSTS_CH_HALTED                 7U

#define HCTL_30_60MHZ                           0U                       /*!< USB clock 30-60MHZ */
#define HCTL_48MHZ                              1U                       /*!< USB clock 48MHZ */
#define HCTL_6MHZ                               2U                       /*!< USB clock 6MHZ */

#define EP0_OUT                   ((uint8_t)0x00U)                       /*!< endpoint OUT 0 */
#define EP0_IN                    ((uint8_t)0x80U)                       /*!< endpoint IN 0 */
#define EP1_OUT                   ((uint8_t)0x01U)                       /*!< endpoint OUT 1 */
#define EP1_IN                    ((uint8_t)0x81U)                       /*!< endpoint IN 1 */
#define EP2_OUT                   ((uint8_t)0x02U)                       /*!< endpoint OUT 2 */
#define EP2_IN                    ((uint8_t)0x82U)                       /*!< endpoint IN 2 */
#define EP3_OUT                   ((uint8_t)0x03U)                       /*!< endpoint OUT 3 */
#define EP3_IN                    ((uint8_t)0x83U)                       /*!< endpoint IN 3 */
#define EP4_OUT                   ((uint8_t)0x04U)                       /*!< endpoint OUT 4 */
#define EP4_IN                    ((uint8_t)0x84U)                       /*!< endpoint IN 4 */
#define EP5_OUT                   ((uint8_t)0x05U)                       /*!< endpoint OUT 5 */
#define EP5_IN                    ((uint8_t)0x85U)                       /*!< endpoint IN 5 */

#endif /* DRV_USB_REGS_H */
